SoCXin/HC32F460/src/template_Rev1.0.5/hc32f460jeta_template/example/EWARM/hc32f460jeta.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>CMP1</name>
            <description>desc CMP</description>
            <baseAddress>0x4004A000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0xA</size>
            </addressBlock>
            <registers>
                <register>
                    <name>CTRL</name>
                    <description>desc CTRL</description>
                    <addressOffset>0x0</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xF1E7</resetMask>
                    <fields>
                        <field>
                            <name>FLTSL</name>
                            <description>desc FLTSL</description>
                            <msb>2</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EDGSL</name>
                            <description>desc EDGSL</description>
                            <msb>6</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>IEN</name>
                            <description>desc IEN</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CVSEN</name>
                            <description>desc CVSEN</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OUTEN</name>
                            <description>desc OUTEN</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INV</name>
                            <description>desc INV</description>
                            <msb>13</msb>
                            <lsb>13</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CMPOE</name>
                            <description>desc CMPOE</description>
                            <msb>14</msb>
                            <lsb>14</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CMPON</name>
                            <description>desc CMPON</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>VLTSEL</name>
                    <description>desc VLTSEL</description>
                    <addressOffset>0x2</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x7F0F</resetMask>
                    <fields>
                        <field>
                            <name>RVSL</name>
                            <description>desc RVSL</description>
                            <msb>3</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CVSL</name>
                            <description>desc CVSL</description>
                            <msb>11</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>C4SL</name>
                            <description>desc C4SL</description>
                            <msb>14</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MON</name>
                    <description>desc MON</description>
                    <addressOffset>0x4</addressOffset>
                    <size>16</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xF01</resetMask>
                    <fields>
                        <field>
                            <name>OMON</name>
                            <description>desc OMON</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>CVST</name>
                            <description>desc CVST</description>
                            <msb>11</msb>
                            <lsb>8</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CVSSTB</name>
                    <description>desc CVSSTB</description>
                    <addressOffset>0x6</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x5</resetValue>
                    <resetMask>0xF</resetMask>
                    <fields>
                        <field>
                            <name>STB</name>
                            <description>desc STB</description>
                            <msb>3</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CVSPRD</name>
                    <description>desc CVSPRD</description>
                    <addressOffset>0x8</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0xF</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>PRD</name>
                            <description>desc PRD</description>
                            <msb>7</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
