SoCXin/HC32F460/src/template_Rev1.0.5/hc32f460jeta_template/example/EWARM/hc32f460jeta.svd
                <register>
                    <name>HFNUM</name>
                    <description>desc HFNUM</description>
                    <addressOffset>0x408</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x3FFF</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>FRNUM</name>
                            <description>desc FRNUM</description>
                            <msb>15</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>FTREM</name>
                            <description>desc FTREM</description>
                            <msb>31</msb>
                            <lsb>16</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HPTXSTS</name>
                    <description>desc HPTXSTS</description>
                    <addressOffset>0x410</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x80100</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>PTXFSAVL</name>
                            <description>desc PTXFSAVL</description>
                            <msb>15</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PTXQSAV</name>
                            <description>desc PTXQSAV</description>
                            <msb>23</msb>
                            <lsb>16</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PTXQTOP</name>
                            <description>desc PTXQTOP</description>
                            <msb>31</msb>
                            <lsb>24</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HAINT</name>
                    <description>desc HAINT</description>
                    <addressOffset>0x414</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFF</resetMask>
                    <fields>
                        <field>
                            <name>HAINT</name>
                            <description>desc HAINT</description>
                            <msb>11</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HAINTMSK</name>
                    <description>desc HAINTMSK</description>
                    <addressOffset>0x418</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFF</resetMask>
                    <fields>
                        <field>
                            <name>HAINTM</name>
                            <description>desc HAINTM</description>
                            <msb>11</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HPRT</name>
                    <description>desc HPRT</description>
                    <addressOffset>0x440</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x61DCF</resetMask>
                    <fields>
                        <field>
                            <name>PCSTS</name>
                            <description>desc PCSTS</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PCDET</name>
                            <description>desc PCDET</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PENA</name>
                            <description>desc PENA</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PENCHNG</name>
                            <description>desc PENCHNG</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PRES</name>
                            <description>desc PRES</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PSUSP</name>
                            <description>desc PSUSP</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PRST</name>
                            <description>desc PRST</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PLSTS</name>
                            <description>desc PLSTS</description>
                            <msb>11</msb>
                            <lsb>10</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PWPR</name>
                            <description>desc PWPR</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PSPD</name>
                            <description>desc PSPD</description>
                            <msb>18</msb>
                            <lsb>17</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HCCHAR0</name>
                    <description>desc HCCHAR0</description>
                    <addressOffset>0x500</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFCEFFFF</resetMask>
                    <fields>
                        <field>
                            <name>MPSIZ</name>
                            <description>desc MPSIZ</description>
                            <msb>10</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EPNUM</name>
                            <description>desc EPNUM</description>
                            <msb>14</msb>
                            <lsb>11</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EPDIR</name>
                            <description>desc EPDIR</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>LSDEV</name>
                            <description>desc LSDEV</description>
                            <msb>17</msb>
                            <lsb>17</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EPTYP</name>
                            <description>desc EPTYP</description>
                            <msb>19</msb>
                            <lsb>18</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>DAD</name>
                            <description>desc DAD</description>
                            <msb>28</msb>
                            <lsb>22</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ODDFRM</name>
                            <description>desc ODDFRM</description>
                            <msb>29</msb>
                            <lsb>29</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CHDIS</name>
                            <description>desc CHDIS</description>
                            <msb>30</msb>
                            <lsb>30</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CHENA</name>
                            <description>desc CHENA</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HCINT0</name>
                    <description>desc HCINT0</description>
                    <addressOffset>0x508</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x7BB</resetMask>
                    <fields>
                        <field>
                            <name>XFRC</name>
                            <description>desc XFRC</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CHH</name>
                            <description>desc CHH</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>STALL</name>
                            <description>desc STALL</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NAK</name>
                            <description>desc NAK</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ACK</name>
                            <description>desc ACK</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TXERR</name>
                            <description>desc TXERR</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BBERR</name>
                            <description>desc BBERR</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FRMOR</name>
                            <description>desc FRMOR</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DTERR</name>
                            <description>desc DTERR</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HCINTMSK0</name>
                    <description>desc HCINTMSK0</description>
                    <addressOffset>0x50C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x7BB</resetMask>
                    <fields>
                        <field>
                            <name>XFRCM</name>
                            <description>desc XFRCM</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CHHM</name>
                            <description>desc CHHM</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>STALLM</name>
                            <description>desc STALLM</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NAKM</name>
                            <description>desc NAKM</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ACKM</name>
                            <description>desc ACKM</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TXERRM</name>
                            <description>desc TXERRM</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BBERRM</name>
                            <description>desc BBERRM</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FRMORM</name>
                            <description>desc FRMORM</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DTERRM</name>
                            <description>desc DTERRM</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HCTSIZ0</name>
                    <description>desc HCTSIZ0</description>
                    <addressOffset>0x510</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x7FFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>XFRSIZ</name>
                            <description>desc XFRSIZ</description>
                            <msb>18</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PKTCNT</name>
                            <description>desc PKTCNT</description>
                            <msb>28</msb>
                            <lsb>19</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DPID</name>
                            <description>desc DPID</description>
                            <msb>30</msb>
                            <lsb>29</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HCDMA0</name>
                    <description>desc HCDMA0</description>
                    <addressOffset>0x514</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <register>
                    <name>HCCHAR1</name>
                    <description>desc HCCHAR1</description>
                    <addressOffset>0x520</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFCEFFFF</resetMask>
                    <fields>
                        <field>
                            <name>MPSIZ</name>
                            <description>desc MPSIZ</description>
                            <msb>10</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EPNUM</name>
                            <description>desc EPNUM</description>
                            <msb>14</msb>
                            <lsb>11</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EPDIR</name>
                            <description>desc EPDIR</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>LSDEV</name>
                            <description>desc LSDEV</description>
                            <msb>17</msb>
                            <lsb>17</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EPTYP</name>
                            <description>desc EPTYP</description>
                            <msb>19</msb>
                            <lsb>18</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>DAD</name>
                            <description>desc DAD</description>
                            <msb>28</msb>
                            <lsb>22</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ODDFRM</name>
                            <description>desc ODDFRM</description>
                            <msb>29</msb>
                            <lsb>29</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CHDIS</name>
                            <description>desc CHDIS</description>
                            <msb>30</msb>
                            <lsb>30</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CHENA</name>
                            <description>desc CHENA</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
